/* Alice and Bob are typing… */
"%1$@ and %2$@ are typing…" = "%1$@ and %2$@ are typing…";

/* Alice, Bob and Charlie are typing… */
"%1$@, %2$@ and %3$@ are typing…" = "%1$@, %2$@ and %3$@ are typing…";

/* Alice, Bob, Charlie and 3 others are typing… */
"%1$@, %2$@, %3$@ and %4$@ others are typing…" = "%1$@, %2$@, %3$@ and %4$@ others are typing…";

/* Alice, Bob, Charlie and 1 other is typing… */
"%1$@, %2$@, %3$@ and 1 other is typing…" = "%1$@, %2$@, %3$@ and 1 other is typing…";

/* Alice and Bob will receive invitations */
"%@ and %@ will receive invitations" = "%1$@ and %2$@ will receive invitations";

/* No comment provided by engineer. */
"%@ invitation" = "%@ invitation";

/* '%@' is the name of a user */
"%@ is out of office" = "%@ is out of office";

/* '%@' is the name of a user */
"%@ is out of office today" = "%@ is out of office today";

/* Alice is typing… */
"%@ is typing…" = "%@ is typing…";

/* {app name} is not installed */
"%@ not installed" = "%@ ei asennettu";

/* {app name} version not supported */
"%@ version not supported" = "%@ version not supported";

/* Alice will receive an invitation */
"%@ will receive an invitation" = "%@ will receive an invitation";

/* Alice, Bob and Charlie will receive invitations */
"%@, %@ and %@ will receive invitations" = "%1$@, %2$@ and %3$@ will receive invitations";

/* Alice, Bob, Charlie and 3 others will receive invitations */
"%@, %@, %@ and %ld others will receive invitations" = "%1$@, %2$@, %3$@ and %4$ld others will receive invitations";

/* Alice, Bob, Charlie and 1 other will receive invitations */
"%@, %@, %@ and 1 other will receive invitations" = "%1$@, %2$@, %3$@ and 1 other will receive invitations";

/* No comment provided by engineer. */
"%d days ago" = "%d päivää sitten";

/* No comment provided by engineer. */
"%d hours ago" = "%d tuntia sitten";

/* No comment provided by engineer. */
"%d minutes ago" = "%d minuuttia sitten";

/* Number of options in a poll */
"%d options" = "%d options";

/* Replies in a thread */
"%d replies" = "%d replies";

/* Votes in a poll */
"%d votes" = "%d votes";

/* '5 active bots' in this conversation */
"%ld active bots" = "%ld active bots";

/* No comment provided by engineer. */
"%ld notifications" = "%ld notifications";

/* No comment provided by engineer. */
"%ld participants" = "%ld osallistujaa";

/* No comment provided by engineer. */
"%ld participants in this call" = "%ld participants in this call";

/* Replies in a thread */
"%ld replies" = "%ld replies";

/* No comment provided by engineer. */
"'Do not disturb' user status is ignored for important conversations" = "'Do not disturb' user status is ignored for important conversations";

/* No comment provided by engineer. */
"1 day" = "1 päivä";

/* No comment provided by engineer. */
"1 hour" = "1 tunti";

/* No comment provided by engineer. */
"1 week" = "1 viikko";

/* First step in scanning QR code instructions */
"1. Access your server in a web browser" = "1. Access your server in a web browser";

/* No comment provided by engineer. */
"15 minutes" = "15 minutes";

/* Second step in scanning QR code instructions */
"2. Go to Settings > Security > Create new app password" = "2. Go to Settings > Security > Create new app password";

/* Message is pinned 24 hours */
"24 hours" = "24 hours";

/* Third step in scanning QR code instructions */
"3. Scan the QR code shown there" = "3. Scan the QR code shown there";

/* Message is pinned 30 days */
"30 days" = "30 days";

/* No comment provided by engineer. */
"30 minutes" = "30 minuuttia";

/* No comment provided by engineer. */
"4 hours" = "4 tuntia";

/* No comment provided by engineer. */
"4 weeks" = "4 viikkoa";

/* Message is pinned 7 days */
"7 days" = "7 days";

/* No comment provided by engineer. */
"8 hours" = "8 tuntia";

/* No comment provided by engineer. */
"@-mentions only" = "Vain @-maininnat";

/* No comment provided by engineer. */
"[Unknown username]" = "[Tuntematon käyttäjänimi]";

/* No comment provided by engineer. */
"About" = "Tietoja";

/* No comment provided by engineer. */
"Absence" = "Absence";

/* No comment provided by engineer. */
"Accept" = "Accept";

/* No comment provided by engineer. */
"Account" = "Tili";

/* No comment provided by engineer. */
"Account already added" = "Tili on jo lisätty";

/* No comment provided by engineer. */
"Account not configured" = "Account not configured";

/* No comment provided by engineer. */
"Account not found" = "Account not found";

/* No comment provided by engineer. */
"Accounts" = "Tilit";

/* No comment provided by engineer. */
"Accuracy" = "Tarkkuus";

/* No comment provided by engineer. */
"Add (%lu)" = "Lisää (%lu)";

/* No comment provided by engineer. */
"Add account" = "Lisää tili";

/* No comment provided by engineer. */
"Add an internal note about this ban" = "Add an internal note about this ban";

/* No comment provided by engineer. */
"Add answer" = "Lisää vastaus";

/* No comment provided by engineer. */
"Add attendees" = "Add attendees";

/* No comment provided by engineer. */
"Add participants" = "Lisää osallistujat";

/* No comment provided by engineer. */
"Add reaction" = "Lisää reaktio";

/* No comment provided by engineer. */
"Add to favorites" = "Lisää suosikkeihin";

/* No comment provided by engineer. */
"Added note to self" = "Added note to self";

/* No comment provided by engineer. */
"Adding a mention will only notify users that did not read the message yet" = "Adding a mention will only notify users that did not read the message yet";

/* No comment provided by engineer. */
"Address" = "Osoite";

/* No comment provided by engineer. */
"Advanced" = "Lisäasetukset";

/* No comment provided by engineer. */
"AirPlay button" = "AirPlay-painike";

/* No comment provided by engineer. */
"All messages" = "Kaikki viestit";

/* No comment provided by engineer. */
"All messages were deleted" = "Kaikki viestit poistettiin";

/* No comment provided by engineer. */
"All notifications are muted" = "Kaikki ilmoitukset on mykistetty";

/* No comment provided by engineer. */
"Allow guests to join this conversation via link" = "Allow guests to join this conversation via link";

/* '@all' should not be translated */
"Allow participants to mention @all" = "Allow participants to mention @all";

/* No comment provided by engineer. */
"Allow to dial-in without a pin" = "Allow to dial-in without a pin";

/* '{Microphone, Camera, ...} access is allowed' */
"Allowed" = "Sallittu";

/* No comment provided by engineer. */
"Alphabetical order" = "Aakkosjärjestys";

/* Sort conversations alphabetically */
"Alphabetically" = "Alphabetically";

/* No comment provided by engineer. */
"Also open to guest app users" = "Also open to guest app users";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"An administrator added you and %ld more participants" = "An administrator added you and %ld more participants";

/* Please put {user0} placeholder in the correct position on the translated text but do not translate it */
"An administrator added you and {user0}" = "An administrator added you and {user0}";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"An administrator added {user0} and %ld more participants" = "An administrator added {user0} and %ld more participants";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"An administrator added {user0} and {user1}" = "An administrator added {user0} and {user1}";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"An administrator demoted you and %ld more participants from moderators" = "An administrator demoted you and %ld more participants from moderators";

/* Please put {user0} placeholder in the correct position on the translated text but do not translate it */
"An administrator demoted you and {user0} from moderators" = "An administrator demoted you and {user0} from moderators";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"An administrator demoted {user0} and %ld more participants from moderators" = "An administrator demoted {user0} and %ld more participants from moderators";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"An administrator demoted {user0} and {user1} from moderators" = "An administrator demoted {user0} and {user1} from moderators";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"An administrator promoted you and %ld more participants to moderators" = "An administrator promoted you and %ld more participants to moderators";

/* Please put {user0} placeholder in the correct position on the translated text but do not translate it */
"An administrator promoted you and {user0} to moderators" = "An administrator promoted you and {user0} to moderators";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"An administrator promoted {user0} and %ld more participants to moderators" = "An administrator promoted {user0} and %ld more participants to moderators";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"An administrator promoted {user0} and {user1} to moderators" = "An administrator promoted {user0} and {user1} to moderators";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"An administrator removed you and %ld more participants" = "An administrator removed you and %ld more participants";

/* Please put {user0} placeholder in the correct position on the translated text but do not translate it */
"An administrator removed you and {user0}" = "An administrator removed you and {user0}";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"An administrator removed {user0} and %ld more participants" = "An administrator removed {user0} and %ld more participants";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"An administrator removed {user0} and {user1}" = "An administrator removed {user0} and {user1}";

/* No comment provided by engineer. */
"An error occurred changing privacy setting" = "An error occurred changing privacy setting";

/* No comment provided by engineer. */
"An error occurred changing read status setting" = "An error occurred changing read status setting";

/* No comment provided by engineer. */
"An error occurred changing typing privacy setting" = "An error occurred changing typing privacy setting";

/* No comment provided by engineer. */
"An error occurred downloading the picture" = "An error occurred downloading the picture";

/* No comment provided by engineer. */
"An error occurred removing profile image" = "An error occurred removing profile image";

/* No comment provided by engineer. */
"An error occurred setting address" = "An error occurred setting address";

/* No comment provided by engineer. */
"An error occurred setting email address" = "An error occurred setting email address";

/* No comment provided by engineer. */
"An error occurred setting phone number" = "An error occurred setting phone number";

/* No comment provided by engineer. */
"An error occurred setting profile image" = "An error occurred setting profile image";

/* No comment provided by engineer. */
"An error occurred setting Twitter account" = "An error occurred setting Twitter account";

/* No comment provided by engineer. */
"An error occurred setting user name" = "An error occurred setting user name";

/* No comment provided by engineer. */
"An error occurred setting website" = "An error occurred setting website";

/* No comment provided by engineer. */
"An error occurred trying to translate message" = "An error occurred trying to translate message";

/* No comment provided by engineer. */
"An error occurred while adding %@ to the room" = "An error occurred while adding %@ to the room";

/* No comment provided by engineer. */
"An error occurred while adding a reaction to a message" = "An error occurred while adding a reaction to a message";

/* No comment provided by engineer. */
"An error occurred while adding note" = "An error occurred while adding note";

/* No comment provided by engineer. */
"An error occurred while clearing status message" = "An error occurred while clearing status message";

/* No comment provided by engineer. */
"An error occurred while creating poll draft" = "An error occurred while creating poll draft";

/* No comment provided by engineer. */
"An error occurred while creating the meeting" = "An error occurred while creating the meeting";

/* No comment provided by engineer. */
"An error occurred while creating the poll" = "An error occurred while creating the poll";

/* No comment provided by engineer. */
"An error occurred while creating the thread" = "An error occurred while creating the thread";

/* No comment provided by engineer. */
"An error occurred while deleting the message" = "Virhe viestiä poistaessa";

/* No comment provided by engineer. */
"An error occurred while deleting the poll draft" = "An error occurred while deleting the poll draft";

/* No comment provided by engineer. */
"An error occurred while disabling absence" = "An error occurred while disabling absence";

/* No comment provided by engineer. */
"An error occurred while editing the poll" = "An error occurred while editing the poll";

/* No comment provided by engineer. */
"An error occurred while opening the file %@" = "An error occurred while opening the file %@";

/* No comment provided by engineer. */
"An error occurred while pinning the message" = "An error occurred while pinning the message";

/* No comment provided by engineer. */
"An error occurred while removing a reaction from a message" = "An error occurred while removing a reaction from a message";

/* No comment provided by engineer. */
"An error occurred while removing the avatar" = "An error occurred while removing the avatar";

/* No comment provided by engineer. */
"An error occurred while sending the message" = "An error occurred while sending the message";

/* No comment provided by engineer. */
"An error occurred while setting \(formattedPhoneNumber) as phone number" = "An error occurred while setting \(formattedPhoneNumber) as phone number";

/* No comment provided by engineer. */
"An error occurred while setting absence" = "An error occurred while setting absence";

/* No comment provided by engineer. */
"An error occurred while setting description" = "An error occurred while setting description";

/* No comment provided by engineer. */
"An error occurred while setting online status" = "An error occurred while setting online status";

/* No comment provided by engineer. */
"An error occurred while setting phone number" = "An error occurred while setting phone number";

/* No comment provided by engineer. */
"An error occurred while setting status message" = "An error occurred while setting status message";

/* No comment provided by engineer. */
"An error occurred while setting the avatar" = "An error occurred while setting the avatar";

/* No comment provided by engineer. */
"An error occurred while setting user status" = "An error occurred while setting user status";

/* No comment provided by engineer. */
"An error occurred while sharing the file" = "An error occurred while sharing the file";

/* No comment provided by engineer. */
"An error occurred while starting a new group conversation" = "An error occurred while starting a new group conversation";

/* No comment provided by engineer. */
"An error occurred while testing push notifications" = "An error occurred while testing push notifications";

/* No comment provided by engineer. */
"An error occurred while unpinning the message" = "An error occurred while unpinning the message";

/* No comment provided by engineer. */
"an hour" = "tunti";

/* No comment provided by engineer. */
"Anonymous poll" = "Anonymous poll";

/* No comment provided by engineer. */
"Answer" = "Answer";

/* No comment provided by engineer. */
"Answers" = "Vastaukset";

/* No comment provided by engineer. */
"App" = "Sovellus";

/* No comment provided by engineer. */
"App is outdated" = "App is outdated";

/* No comment provided by engineer. */
"Appear offline" = "Näytä olevan poissa";

/* No comment provided by engineer. */
"Archive conversation" = "Archive conversation";

/* No comment provided by engineer. */
"Archived conversations" = "Archived conversations";

/* No comment provided by engineer. */
"Archived conversations are hidden from the conversation list by default. They will only be shown when you open archived conversations list." = "Archived conversations are hidden from the conversation list by default. They will only be shown when you open archived conversations list.";

/* No comment provided by engineer. */
"Ask a question" = "Esitä kysymys";

/* No comment provided by engineer. */
"Attachments allowed?" = "Sallitaanko liitteet?";

/* No comment provided by engineer. */
"Attendees" = "Attendees";

/* Join a call in audio only mode */
"Audio only" = "Audio only";

/* No comment provided by engineer. */
"Audio options" = "Audio options";

/* No comment provided by engineer. */
"Audio, video and screen shares" = "Audio, video and screen shares";

/* No comment provided by engineer. */
"Audios" = "Audios";

/* No comment provided by engineer. */
"Away" = "Poissa";

/* No comment provided by engineer. */
"Back to conversations" = "Palaa keskusteluihin";

/* Ban a user/guest */
"Ban" = "Ban";

/* e.g. Ban John Doe */
"Ban %@" = "Ban %@";

/* No comment provided by engineer. */
"Ban participant" = "Ban participant";

/* Date and time of ban creation */
"Banned by:" = "Banned by:";

/* No comment provided by engineer. */
"Banned users and guests" = "Banned users and guests";

/* Bold text */
"Bold" = "Bold";

/* No comment provided by engineer. */
"bot" = "bot";

/* No comment provided by engineer. */
"Bots" = "Bots";

/* No comment provided by engineer. */
"Browse poll drafts" = "Browse poll drafts";

/* No comment provided by engineer. */
"Busy" = "Busy";

/* Sort conversations by recent activity */
"By activity" = "By activity";

/* No comment provided by engineer. */
"Cached files" = "Cached files";

/* No comment provided by engineer. */
"Cached images" = "Cached images";

/* No comment provided by engineer. */
"Calendar" = "Kalenteri";

/* No comment provided by engineer. */
"Call notification sent" = "Call notification sent";

/* No comment provided by engineer. */
"Call options" = "Call options";

/* No comment provided by engineer. */
"Call recording enabled?" = "Call recording enabled?";

/* No comment provided by engineer. */
"Call recording failed. Please contact your administrator" = "Call recording failed. Please contact your administrator";

/* No comment provided by engineer. */
"Call recording is starting" = "Call recording is starting";

/* No comment provided by engineer. */
"Call recording started" = "Call recording started";

/* No comment provided by engineer. */
"Call recording stopped" = "Call recording stopped";

/* No comment provided by engineer. */
"Call without notification" = "Puhelu ilman ilmoitusta";

/* No comment provided by engineer. */
"Calling is currently not supported because end-to-end-encryption is enabled on the server" = "Calling is currently not supported because end-to-end-encryption is enabled on the server";

/* No comment provided by engineer. */
"CallKit supported?" = "CallKit supported?";

/* No comment provided by engineer. */
"Calls" = "Puhelut";

/* No comment provided by engineer. */
"Calls enabled?" = "Calls enabled?";

/* No comment provided by engineer. */
"Calls from an old account were received." = "Calls from an old account were received.";

/* No comment provided by engineer. */
"Calls from old accounts" = "Calls from old accounts";

/* No comment provided by engineer. */
"Camera" = "Kamera";

/* No comment provided by engineer. */
"Camera access" = "Camera access";

/* No comment provided by engineer. */
"Camera access is not allowed. Check your settings." = "Camera access is not allowed. Check your settings.";

/* No comment provided by engineer. */
"Camera disabled" = "Kamera poistettu käytöstä";

/* No comment provided by engineer. */
"Camera enabled" = "Kamera otettu käyttöön";

/* No comment provided by engineer. */
"Can create conversations?" = "Can create conversations?";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancelled call from another account" = "Cancelled call from another account";

/* No comment provided by engineer. */
"Cannot share to conversation" = "Cannot share to conversation";

/* No comment provided by engineer. */
"Capabilities" = "Capabilities";

/* No comment provided by engineer. */
"Change password" = "Vaihda salasana";

/* No comment provided by engineer. */
"Change your vote" = "Muuta antamaasi ääntä";

/* No comment provided by engineer. */
"Chat" = "Keskustelu";

/* No comment provided by engineer. */
"Chat messages" = "Keskustelun viestit";

/* No comment provided by engineer. */
"Clear cache" = "Tyhjennä välimuisti";

/* No comment provided by engineer. */
"Clear cached chat messages" = "Clear cached chat messages";

/* No comment provided by engineer. */
"Clear reminder" = "Clear reminder";

/* No comment provided by engineer. */
"Clear status message" = "Tyhjennä tilaviesti";

/* No comment provided by engineer. */
"Clear status message after" = "Tyhjennä tilaviesti, kun on kulunut";

/* No comment provided by engineer. */
"Close" = "Sulje";

/* Code block */
"Code" = "Code";

/* No comment provided by engineer. */
"Configuration" = "Asetukset";

/* No comment provided by engineer. */
"Configure your next absence period" = "Configure your next absence period";

/* No comment provided by engineer. */
"Confirm and hide warning" = "Confirm and hide warning";

/* No comment provided by engineer. */
"Connecting to %@ …" = "Yhdistetään kohteeseen %@…";

/* No comment provided by engineer. */
"Connecting to the call …" = "Yhdistetään puheluun…";

/* No comment provided by engineer. */
"Contact access" = "Contact access";

/* No comment provided by engineer. */
"Contact access has been denied" = "Contact access has been denied";

/* No comment provided by engineer. */
"Contacts" = "Yhteystiedot";

/* No comment provided by engineer. */
"Conversation creation failed" = "Conversation creation failed";

/* No comment provided by engineer. */
"Conversation details" = "Conversation details";

/* No comment provided by engineer. */
"Conversation name" = "Keskustelun nimi";

/* No comment provided by engineer. */
"Conversation name cannot be empty" = "Conversation name cannot be empty";

/* No comment provided by engineer. */
"Conversation not found" = "Keskustelua ei löydy";

/* No comment provided by engineer. */
"Conversation not found or not joined" = "Conversation not found or not joined";

/* No comment provided by engineer. */
"Conversation participants" = "Conversation participants";

/* No comment provided by engineer. */
"Conversation password has been removed" = "Conversation password has been removed";

/* No comment provided by engineer. */
"Conversation password has been saved" = "Conversation password has been saved";

/* No comment provided by engineer. */
"Conversation settings" = "Keskustelun asetukset";

/* No comment provided by engineer. */
"Conversations" = "Keskustelut";

/* No comment provided by engineer. */
"Copy" = "Kopioi";

/* No comment provided by engineer. */
"Copy message link" = "Copy message link";

/* No comment provided by engineer. */
"Copy message selection" = "Copy message selection";

/* No comment provided by engineer. */
"Could not access camera" = "Could not access camera";

/* No comment provided by engineer. */
"Could not access microphone" = "Could not access microphone";

/* No comment provided by engineer. */
"Could not access speech recognition" = "Could not access speech recognition";

/* No comment provided by engineer. */
"Could not access your location" = "Could not access your location";

/* No comment provided by engineer. */
"Could not add participant" = "Could not add participant";

/* No comment provided by engineer. */
"Could not ban participant" = "Could not ban participant";

/* No comment provided by engineer. */
"Could not change archived conversation setting" = "Could not change archived conversation setting";

/* No comment provided by engineer. */
"Could not change call notifications setting" = "Could not change call notifications setting";

/* No comment provided by engineer. */
"Could not change important conversation setting" = "Could not change important conversation setting";

/* No comment provided by engineer. */
"Could not change listable scope of the conversation" = "Could not change listable scope of the conversation";

/* No comment provided by engineer. */
"Could not change lobby state of the conversation" = "Could not change lobby state of the conversation";

/* No comment provided by engineer. */
"Could not change mention permissions of the conversation" = "Could not change mention permissions of the conversation";

/* No comment provided by engineer. */
"Could not change moderation permissions of the participant" = "Could not change moderation permissions of the participant";

/* No comment provided by engineer. */
"Could not change notifications setting" = "Could not change notifications setting";

/* No comment provided by engineer. */
"Could not change password protection settings" = "Could not change password protection settings";

/* No comment provided by engineer. */
"Could not change read-only state of the conversation" = "Could not change read-only state of the conversation";

/* No comment provided by engineer. */
"Could not change sensitive conversation setting" = "Could not change sensitive conversation setting";

/* No comment provided by engineer. */
"Could not change sharing permissions of the conversation" = "Could not change sharing permissions of the conversation";

/* No comment provided by engineer. */
"Could not change SIP state of the conversation" = "Could not change SIP state of the conversation";

/* No comment provided by engineer. */
"Could not clear chat history" = "Could not clear chat history";

/* No comment provided by engineer. */
"Could not clear status message" = "Could not clear status message";

/* No comment provided by engineer. */
"Could not create meeting" = "Could not create meeting";

/* No comment provided by engineer. */
"Could not delete conversation" = "Keskustelua ei voitu poistaa";

/* No comment provided by engineer. */
"Could not disable absence" = "Could not disable absence";

/* No comment provided by engineer. */
"Could not get available languages" = "Could not get available languages";

/* No comment provided by engineer. */
"Could not join %@ call" = "Could not join %@ call";

/* No comment provided by engineer. */
"Could not join call with %@" = "Could not join call with %@";

/* No comment provided by engineer. */
"Could not join conversation" = "Could not join conversation";

/* No comment provided by engineer. */
"Could not leave conversation" = "Ei voitu poistua keskustelusta";

/* No comment provided by engineer. */
"Could not login with QR code" = "Could not login with QR code";

/* No comment provided by engineer. */
"Could not prepare upload folder" = "Could not prepare upload folder";

/* No comment provided by engineer. */
"Could not remove participant" = "Could not remove participant";

/* No comment provided by engineer. */
"Could not rename the conversation" = "Could not rename the conversation";

/* No comment provided by engineer. */
"Could not resend email invitations" = "Could not resend email invitations";

/* No comment provided by engineer. */
"Could not send call notification" = "Could not send call notification";

/* No comment provided by engineer. */
"Could not send the message" = "Viestiä ei voitu lähettää";

/* No comment provided by engineer. */
"Could not set absence" = "Could not set absence";

/* No comment provided by engineer. */
"Could not set conversation name" = "Could not set conversation name";

/* No comment provided by engineer. */
"Could not set message expiration time" = "Could not set message expiration time";

/* No comment provided by engineer. */
"Could not set online status" = "Could not set online status";

/* No comment provided by engineer. */
"Could not set phone number" = "Could not set phone number";

/* No comment provided by engineer. */
"Could not set status message" = "Tilaviestiä ei voitu asettaa";

/* No comment provided by engineer. */
"Could not share file" = "Tiedostoa ei voitu jakaa";

/* No comment provided by engineer. */
"Could not start group conversation" = "Could not start group conversation";

/* No comment provided by engineer. */
"Create" = "Luo";

/* No comment provided by engineer. */
"Create a new conversation" = "Luo uusi keskustelu";

/* No comment provided by engineer. */
"Create a thread" = "Create a thread";

/* No comment provided by engineer. */
"Create or join a conversation" = "Create or join a conversation";

/* No comment provided by engineer. */
"Create poll" = "Luo kysely";

/* No comment provided by engineer. */
"Creating poll draft failed" = "Creating poll draft failed";

/* No comment provided by engineer. */
"Creating poll failed" = "Creating poll failed";

/* No comment provided by engineer. */
"Credentials for this account were no longer valid" = "Tämän tilin kirjautumistiedot eivät olleet enää kelvolliset";

/* Custom message expiration */
"Custom" = "Custom";

/* name of a moderator who banned a participant */
"Date:" = "Date:";

/* No comment provided by engineer. */
"days" = "päivää";

/* No comment provided by engineer. */
"Deck cards" = "Deck cards";

/* No comment provided by engineer. */
"Default" = "Oletus";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* Short version for confirmation button. Complete text is 'Delete all messages'. */
"Delete all" = "Poista kaikki";

/* No comment provided by engineer. */
"Delete all messages" = "Poista kaikki viestit";

/* No comment provided by engineer. */
"Delete conversation" = "Poista keskustelu";

/* Delete a conversation right now without waiting for auto-deletion */
"Delete now" = "Delete now";

/* No comment provided by engineer. */
"Deleted user" = "Deleted user";

/* No comment provided by engineer. */
"Deleting message" = "Poistetaan viestiä";

/* No comment provided by engineer. */
"Deleting poll draft failed" = "Deleting poll draft failed";

/* No comment provided by engineer. */
"Demote from moderator" = "Alenna moderaattorista";

/* '{Microphone, Camera, ...} access is denied' */
"Denied" = "Estetty";

/* No comment provided by engineer. */
"Description" = "Kuvaus";

/* No comment provided by engineer. */
"Description cannot be longer than 500 characters" = "Description cannot be longer than 500 characters";

/* No comment provided by engineer. */
"Details" = "Details";

/* No comment provided by engineer. */
"detected" = "detected";

/* No comment provided by engineer. */
"Detecting language" = "Detecting language";

/* No comment provided by engineer. */
"Diagnostics" = "Diagnostiikka";

/* No comment provided by engineer. */
"Disable" = "Disable";

/* No comment provided by engineer. */
"Disable absence" = "Disable absence";

/* No comment provided by engineer. */
"Disable blur" = "Disable blur";

/* speaker = Loudspeaker, device */
"Disable speaker" = "Disable speaker";

/* No comment provided by engineer. */
"Disconnected" = "Yhteys katkaistu";

/* No comment provided by engineer. */
"Dismiss" = "Hylkää";

/* No comment provided by engineer. */
"Dismiss notification" = "Hylkää ilmoitus";

/* No comment provided by engineer. */
"Do not disturb" = "Älä häiritse";

/* No comment provided by engineer. */
"Do you really want to clear the file cache?" = "Do you really want to clear the file cache?";

/* No comment provided by engineer. */
"Do you really want to clear the image cache?" = "Do you really want to clear the image cache?";

/* No comment provided by engineer. */
"Do you really want to delete all messages in this conversation?" = "Haluatko varmasti poistaa kaikki viestit tästä keskustelusta?";

/* No comment provided by engineer. */
"Do you really want to delete this conversation for everyone?" = "Do you really want to delete this conversation for everyone?";

/* No comment provided by engineer. */
"Do you really want to end this poll?" = "Do you really want to end this poll?";

/* No comment provided by engineer. */
"Do you really want to log out from this account?" = "Haluatko varmasti kirjautua ulos tältä tililtä?";

/* No comment provided by engineer. */
"Do you really want to remove this account?" = "Haluatko varmasti poistaa tämän tilin?";

/* No comment provided by engineer. */
"Do you want to connect to the server anyway?" = "Haluatko silti yhdistää palvelimeen?";

/* No comment provided by engineer. */
"Do you want to delete this conversation?" = "Do you want to delete this conversation?";

/* No comment provided by engineer. */
"Do you want to enable your camera?" = "Haluatko ottaa kameran käyttöön?";

/* No comment provided by engineer. */
"Do you want to join this call?" = "Haluatko liittyä tähän puheluun?";

/* No comment provided by engineer. */
"Do you want to share '%@' in the conversation?" = "Do you want to share '%@' in the conversation?";

/* No comment provided by engineer. */
"Do you want to stop the recording?" = "Do you want to stop the recording?";

/* No comment provided by engineer. */
"Don't clear" = "Älä tyhjennä";

/* No comment provided by engineer. */
"Double tap to dismiss authentication dialog" = "Double tap to dismiss authentication dialog";

/* No comment provided by engineer. */
"Double tap to dismiss sharing options" = "Double tap to dismiss sharing options";

/* No comment provided by engineer. */
"Double tap to display call options" = "Double tap to display call options";

/* A menu to show additional options for the current conversation */
"Double tap to display option menu" = "Double tap to display option menu";

/* No comment provided by engineer. */
"Double tap to display thread notification level options" = "Double tap to display thread notification level options";

/* No comment provided by engineer. */
"Double tap to edit profile" = "Double tap to edit profile";

/* No comment provided by engineer. */
"Double tap to enable or disable 'Call without notification' option" = "Double tap to enable or disable 'Call without notification' option";

/* No comment provided by engineer. */
"Double tap to enable or disable the camera" = "Double tap to enable or disable the camera";

/* No comment provided by engineer. */
"Double tap to enable or disable the microphone" = "Double tap to enable or disable the microphone";

/* speaker = Loudspeaker, device */
"Double tap to enable or disable the speaker" = "Double tap to enable or disable the speaker";

/* No comment provided by engineer. */
"Double tap to end editing profile" = "Double tap to end editing profile";

/* No comment provided by engineer. */
"Double tap to go to conversation information" = "Double tap to go to conversation information";

/* No comment provided by engineer. */
"Double tap to go to user profile and application settings" = "Double tap to go to user profile and application settings";

/* No comment provided by engineer. */
"Double tap to hang up the call" = "Double tap to hang up the call";

/* No comment provided by engineer. */
"Double tap to lower hand" = "Double tap to lower hand";

/* No comment provided by engineer. */
"Double tap to open file browser" = "Double tap to open file browser";

/* No comment provided by engineer. */
"Double tap to select different audio routes" = "Double tap to select different audio routes";

/* No comment provided by engineer. */
"Double tap to send message" = "Double tap to send message";

/* No comment provided by engineer. */
"Double tap to share with selected conversations" = "Double tap to share with selected conversations";

/* No comment provided by engineer. */
"Double tap to show more actions" = "Double tap to show more actions";

/* No comment provided by engineer. */
"Double tap to show or hide chat view" = "Double tap to show or hide chat view";

/* No comment provided by engineer. */
"Double tap to start a video call" = "Double tap to start a video call";

/* No comment provided by engineer. */
"Double tap to start a voice only call" = "Double tap to start a voice only call";

/* No comment provided by engineer. */
"Double tap to stop recording" = "Double tap to stop recording";

/* No comment provided by engineer. */
"Double tap to upgrade this voice call to a video call" = "Double tap to upgrade this voice call to a video call";

/* No comment provided by engineer. */
"Duplicate session" = "Duplicate session";

/* Edit a message or room participants */
"Edit" = "Muokkaa";

/* No comment provided by engineer. */
"Edit attendees" = "Edit attendees";

/* No comment provided by engineer. */
"Edit thread details" = "Edit thread details";

/* A message was edited */
"edited" = "edited";

/* A message was edited by ... */
"edited by" = "edited by";

/* A message was edited by ... */
"Edited by" = "Edited by";

/* No comment provided by engineer. */
"Editing Message" = "Editing Message";

/* No comment provided by engineer. */
"Editing poll draft" = "Editing poll draft";

/* No comment provided by engineer. */
"Editing poll failed" = "Editing poll failed";

/* No comment provided by engineer. */
"Either you don't have chat permission or the conversation is read-only." = "Either you don't have chat permission or the conversation is read-only.";

/* No comment provided by engineer. */
"Email" = "Sähköposti";

/* No comment provided by engineer. */
"Empty summary response" = "Empty summary response";

/* No comment provided by engineer. */
"Enable" = "Ota käyttöön";

/* No comment provided by engineer. */
"Enable blur" = "Enable blur";

/* No comment provided by engineer. */
"Enable screensharing" = "Enable screensharing";

/* No comment provided by engineer. */
"Enable speaker" = "Enable speaker";

/* No comment provided by engineer. */
"Enabled" = "Enabled";

/* No comment provided by engineer. */
"End call" = "End call";

/* No comment provided by engineer. */
"End call for everyone" = "End call for everyone";

/* No comment provided by engineer. */
"End poll" = "End poll";

/* No comment provided by engineer. */
"Enter a new password" = "Enter a new password";

/* No comment provided by engineer. */
"Enter a password" = "Enter a password";

/* No comment provided by engineer. */
"Error creating server path for upload" = "Error creating server path for upload";

/* No comment provided by engineer. */
"Error occurred when creating a reminder" = "Error occurred when creating a reminder";

/* No comment provided by engineer. */
"Error occurred while editing a message" = "Error occurred while editing a message";

/* External signaling used */
"External" = "Ulkoinen";

/* No comment provided by engineer. */
"Failed to accept invitation" = "Failed to accept invitation";

/* No comment provided by engineer. */
"Failed to check or create attachment folder" = "Failed to check or create attachment folder";

/* No comment provided by engineer. */
"Failed to clear reminder" = "Failed to clear reminder";

/* No comment provided by engineer. */
"Failed to connect to %@" = "Failed to connect to %@";

/* No comment provided by engineer. */
"Failed to forward message" = "Failed to forward message";

/* No comment provided by engineer. */
"Failed to get calendar to schedule a meeting" = "Failed to get calendar to schedule a meeting";

/* No comment provided by engineer. */
"Failed to reject invitation" = "Failed to reject invitation";

/* No comment provided by engineer. */
"Failed to send message" = "Viestin lähetys epäonnistui";

/* No comment provided by engineer. */
"Failed to share recording" = "Failed to share recording";

/* No comment provided by engineer. */
"Failed to unban selected entry" = "Failed to unban selected entry";

/* No comment provided by engineer. */
"Federated" = "Federoitu";

/* No comment provided by engineer. */
"Fetching status …" = "Fetching status …";

/* Filename of a file */
"File" = "File";

/* No comment provided by engineer. */
"Files" = "Tiedostot";

/* No comment provided by engineer. */
"Filter and sort conversations" = "Filter and sort conversations";

/* Title for available conversations filters */
"Filters" = "Filters";

/* No comment provided by engineer. */
"First day" = "First day";

/* No comment provided by engineer. */
"Follow conversation settings" = "Follow conversation settings";

/* No comment provided by engineer. */
"For password reset and notifications" = "Salasanan nollausta ja ilmoituksia varten";

/* No comment provided by engineer. */
"Format" = "Format";

/* No comment provided by engineer. */
"Forward" = "Välitä";

/* No comment provided by engineer. */
"Forward to" = "Forward to";

/* 'From' which language user wants to translate text */
"From" = "From";

/* from Alice at nextcloud.local */
"from %@ at %@" = "from %1$@ at %2$@";

/* No comment provided by engineer. */
"Full name" = "Koko nimi";

/* No comment provided by engineer. */
"Generate summary" = "Generate summary";

/* No comment provided by engineer. */
"Generating summary of unread messages" = "Generating summary of unread messages";

/* No comment provided by engineer. */
"Generating summary of unread messages failed" = "Generating summary of unread messages failed";

/* No comment provided by engineer. */
"Get source code" = "Lataa lähdekoodi";

/* No comment provided by engineer. */
"GitHub API error" = "GitHubin rajapintavirhe";

/* Give consent to the recording of the call and join that call */
"Give consent and join call" = "Give consent and join call";

/* No comment provided by engineer. */
"Go to message" = "Go to message";

/* Show group conversations before private ones */
"Group first" = "Group first";

/* No comment provided by engineer. */
"guest" = "vieras";

/* No comment provided by engineer. */
"Guest" = "Vieras";

/* No comment provided by engineer. */
"Guests access" = "Vieraiden pääsy";

/* No comment provided by engineer. */
"Guests app enabled?" = "Guests app enabled?";

/* No comment provided by engineer. */
"Hang up" = "Lopeta";

/* TRANSLATORS this is a video quality option (Video quality : HD) */
"HD" = "HD";

/* No comment provided by engineer. */
"Hide" = "Hide";

/* TRANSLATORS this is a video quality option (Video quality : High) */
"High" = "High";

/* No comment provided by engineer. */
"hours" = "tuntia";

/* No comment provided by engineer. */
"How do you want to join the call?" = "How do you want to join the call?";

/* No comment provided by engineer. */
"If you delete the conversation, it will also be deleted for %@" = "If you delete the conversation, it will also be deleted for %@";

/* No comment provided by engineer. */
"If you enable your camera, this call will be interrupted for a few seconds." = "If you enable your camera, this call will be interrupted for a few seconds.";

/* No comment provided by engineer. */
"If you're using multiple servers, you need to check all of them." = "If you're using multiple servers, you need to check all of them.";

/* No comment provided by engineer. */
"Images, files, voice messages…" = "Kuvat, tiedostot, ääniviestit…";

/* No comment provided by engineer. */
"Import account" = "Tuo tili";

/* No comment provided by engineer. */
"Important conversation" = "Important conversation";

/* No comment provided by engineer. */
"in" = "in";

/* No comment provided by engineer. */
"Include calls in call history" = "Include calls in call history";

/* Message is pinned indefinitely */
"Indefinitely" = "Indefinitely";

/* Internal signaling used */
"Internal" = "Sisäinen";

/* Internal note about why a user/guest was banned */
"Internal note" = "Internal note";

/* No comment provided by engineer. */
"Invalid date range" = "Invalid date range";

/* No comment provided by engineer. */
"Invalid email address" = "Invalid email address";

/* No comment provided by engineer. */
"Invalid end date" = "Invalid end date";

/* No comment provided by engineer. */
"Invalid server address" = "Virheellinen palvelimen osoite";

/* No comment provided by engineer. */
"Invalid start date" = "Invalid start date";

/* No comment provided by engineer. */
"Invisible" = "Näkymätön";

/* No comment provided by engineer. */
"Invitation resent" = "Invitation resent";

/* No comment provided by engineer. */
"Invitations resent" = "Invitations resent";

/* Invitation for a meeting */
"Invite all users and emails" = "Invite all users and emails";

/* It seems that {app name} is not installed in your server. */
"It seems that %@ is not installed in your server." = "It seems that %@ is not installed in your server.";

/* No comment provided by engineer. */
"It seems that there is no internet connection." = "It seems that there is no internet connection.";

/* Italic text */
"Italic" = "Italic";

/* No comment provided by engineer. */
"Join a conversation or start a new one" = "Liity keskusteluun tai aloita uusi";

/* No comment provided by engineer. */
"Join call" = "Join call";

/* No comment provided by engineer. */
"Join call (audio only)" = "Join call (audio only)";

/* No comment provided by engineer. */
"Join call with video" = "Join call with video";

/* No comment provided by engineer. */
"Join open conversations" = "Join open conversations";

/* No comment provided by engineer. */
"Join video call" = "Join video call";

/* No comment provided by engineer. */
"Keep" = "Pidä";

/* No comment provided by engineer. */
"Last day (inclusive)" = "Last day (inclusive)";

/* Last subscription to the push notification server */
"Last subscription" = "Last subscription";

/* No comment provided by engineer. */
"Last sync" = "Last sync";

/* Remind me later today about that message */
"Later today" = "Later today";

/* No comment provided by engineer. */
"Leave" = "Poistu";

/* No comment provided by engineer. */
"Leave call" = "Leave call";

/* No comment provided by engineer. */
"Leave conversation" = "Poistu keskustelusta";

/* No comment provided by engineer. */
"less than a minute ago" = "alle minuutti sitten";

/* No comment provided by engineer. */
"Link https://…" = "Linkki https://…";

/* No comment provided by engineer. */
"Linked file" = "Linked file";

/* No comment provided by engineer. */
"Load more results" = "Lataa lisää tuloksia";

/* No comment provided by engineer. */
"Lobby" = "Aula";

/* No comment provided by engineer. */
"Lobby is still active and you're not a moderator" = "Lobby is still active and you're not a moderator";

/* No comment provided by engineer. */
"Local" = "Paikallinen";

/* No comment provided by engineer. */
"Local time: %@" = "Local time: %@";

/* No comment provided by engineer. */
"Location" = "Sijainti";

/* No comment provided by engineer. */
"Location access" = "Location access";

/* No comment provided by engineer. */
"Location service has been denied. Check your settings." = "Location service has been denied. Check your settings.";

/* No comment provided by engineer. */
"Location service is not enabled" = "Sijaintipalvelu ei ole käytössä";

/* No comment provided by engineer. */
"Locations" = "Sijainnit";

/* No comment provided by engineer. */
"Lock conversation" = "Lukitse keskustelu";

/* No comment provided by engineer. */
"Log in" = "Kirjaudu";

/* No comment provided by engineer. */
"Log out" = "Kirjaudu ulos";

/* No comment provided by engineer. */
"Logged out" = "Kirjauduttu ulos";

/* No comment provided by engineer. */
"Long absence message" = "Long absence message";

/* TRANSLATORS this is a video quality option (Video quality : Low) */
"Low" = "Low";

/* No comment provided by engineer. */
"Lower hand" = "Laske käsi";

/* TRANSLATORS this is used when no meeting start time is set and the meeting will be started manually */
"Manual" = "Manuaalinen";

/* No comment provided by engineer. */
"Mark as read" = "Merkitse luetuksi";

/* No comment provided by engineer. */
"Mark as unread" = "Merkitse lukemattomaksi";

/* No comment provided by engineer. */
"Match system contacts" = "Match system contacts";

/* No comment provided by engineer. */
"Media" = "Media";

/* No comment provided by engineer. */
"Meeting created" = "Meeting created";

/* No comment provided by engineer. */
"Meeting ended" = "Meeting ended";

/* No comment provided by engineer. */
"Meeting ID" = "Tapaamisen tunniste";

/* No comment provided by engineer. */
"Meeting settings" = "Kokouksen asetukset";

/* 'Meetings' meaning 'Conversations that were created from a calendar event'
   Headline for a 'meeting section' */
"Meetings" = "Meetings";

/* 'Mentioned' meaning 'Mentioned conversations' */
"Mentioned" = "Mentioned";

/* Copy 'message' */
"Message" = "Message";

/* No comment provided by engineer. */
"Message copied" = "Viesti kopioitu";

/* No comment provided by engineer. */
"Message could not be deleted because it is too old" = "Message could not be deleted because it is too old";

/* No comment provided by engineer. */
"Message deleted successfully" = "Viesti poistettu onnistuneesti";

/* No comment provided by engineer. */
"Message deleted successfully, but Matterbridge is configured and the message might already be distributed to other services" = "Message deleted successfully, but Matterbridge is configured and the message might already be distributed to other services";

/* No comment provided by engineer. */
"Message editing failed" = "Message editing failed";

/* No comment provided by engineer. */
"Message expiration" = "Viestin vanheneminen";

/* Copy 'link' to a message */
"Message link" = "Message link";

/* No comment provided by engineer. */
"Message link copied" = "Message link copied";

/* No comment provided by engineer. */
"Message pinned" = "Message pinned";

/* No comment provided by engineer. */
"Message preview will be disabled in conversation list and notifications" = "Message preview will be disabled in conversation list and notifications";

/* No comment provided by engineer. */
"Message rescheduling failed" = "Message rescheduling failed";

/* No comment provided by engineer. */
"Message scheduling failed" = "Message scheduling failed";

/* No comment provided by engineer. */
"Message successfully edited" = "Message successfully edited";

/* No comment provided by engineer. */
"Message successfully rescheduled" = "Message successfully rescheduled";

/* No comment provided by engineer. */
"Message successfully scheduled" = "Message successfully scheduled";

/* No comment provided by engineer. */
"Message unpinned" = "Message unpinned";

/* No comment provided by engineer. */
"Messages" = "Viestit";

/* No comment provided by engineer. */
"Microphone" = "Mikrofoni";

/* No comment provided by engineer. */
"Microphone access" = "Microphone access";

/* No comment provided by engineer. */
"Microphone access is not allowed. Check your settings." = "Microphone access is not allowed. Check your settings.";

/* No comment provided by engineer. */
"Microphone disabled" = "Mikrofoni pois käytöstä";

/* No comment provided by engineer. */
"Microphone enabled" = "Mikrofoni käytössä";

/* No comment provided by engineer. */
"minutes" = "minuuttia";

/* No comment provided by engineer. */
"Missed call from" = "Missed call from";

/* No comment provided by engineer. */
"Missing phone number information" = "Missing phone number information";

/* The signaling mode used */
"Mode" = "Tila";

/* No comment provided by engineer. */
"moderator" = "moderaattori";

/* No comment provided by engineer. */
"Modification date" = "Muokkauspäivämäärä";

/* More menu elements */
"More" = "More";

/* No comment provided by engineer. */
"More actions" = "Lisää toimintoja";

/* No comment provided by engineer. */
"Multiple answers" = "Useita vastauksia";

/* No comment provided by engineer. */
"Mute all notifications" = "Mykistä kaikki ilmoitukset";

/* No comment provided by engineer. */
"Mute others" = "Mute others";

/* No comment provided by engineer. */
"My location" = "Minun sijaintini";

/* No comment provided by engineer. */
"Name" = "Nimi";

/* No comment provided by engineer. */
"Nearby places" = "Nearby places";

/* No comment provided by engineer. */
"Network available" = "Verkko saatavilla";

/* No comment provided by engineer. */
"Network not available" = "Verkko ei saatavilla";

/* Never subscribed to the push notification server */
"Never subscribed" = "Never subscribed";

/* No comment provided by engineer. */
"New conversation" = "Uusi keskustelu";

/* No comment provided by engineer. */
"New poll" = "Uusi kysely";

/* Remind me next week about that message */
"Next week" = "Next week";

/* No comment provided by engineer. */
"Tassos server not found" = "Tassos-palvelinta ei löytynyt";

/* No comment provided by engineer. */
"No" = "Ei";

/* No comment provided by engineer. */
"No actions available" = "No actions available";

/* No comment provided by engineer. */
"No active account found" = "No active account found";

/* No comment provided by engineer. */
"No active bots" = "No active bots";

/* No comment provided by engineer. */
"No AI provider available or summarizing failed" = "No AI provider available or summarizing failed";

/* No comment provided by engineer. */
"No banned users or guests" = "No banned users or guests";

/* No comment provided by engineer. */
"No bots available for this conversation" = "No bots available for this conversation";

/* No comment provided by engineer. */
"No description provided" = "Kuvausta ei määritetty";

/* No comment provided by engineer. */
"No files in here" = "Täällä ei ole tiedostoja";

/* 'No filter' meaning 'No filter will be applied in conversations list' */
"No filter" = "No filter";

/* No comment provided by engineer. */
"No followed threads" = "Ei seurattuja keskusteluketjuja";

/* Do not group conversations by type */
"No grouping" = "No grouping";

/* No comment provided by engineer. */
"No messages found to summarize" = "No messages found to summarize";

/* No comment provided by engineer. */
"No messages yet, start the conversation!" = "Ei vielä viestejä, aloita keskustelu!";

/* No comment provided by engineer. */
"No participants found" = "Ei osallistujia löydetty";

/* No comment provided by engineer. */
"No permission to join this conversation" = "No permission to join this conversation";

/* No comment provided by engineer. */
"No poll drafts saved yet" = "No poll drafts saved yet";

/* No comment provided by engineer. */
"No recent threads" = "No recent threads";

/* No comment provided by engineer. */
"No response from server" = "Ei vastausta palvelimelta";

/* No comment provided by engineer. */
"No results found" = "Ei tuloksia";

/* No comment provided by engineer. */
"No shared items" = "No shared items";

/* No comment provided by engineer. */
"No upcoming events" = "No upcoming events";

/* No comment provided by engineer. */
"No user found" = "No user found";

/* TRANSLATORS this is a video quality option (Video quality : Normal) */
"Normal" = "Normal";

/* '{Microphone, Camera, ...} access was not requested' */
"Not requested" = "Not requested";

/* No comment provided by engineer. */
"Note to self" = "Muistiinpanot itselle";

/* Internal note for moderators, usually a reason for this ban */
"Note:" = "Note:";

/* No comment provided by engineer. */
"Notifications" = "Ilmoitukset";

/* No comment provided by engineer. */
"Notifications app enabled?" = "Notifications app enabled?";

/* No comment provided by engineer. */
"Notify about calls" = "Notify about calls";

/* Indicates an event happening right now */
"Now" = "Nyt";

/* No comment provided by engineer. */
"Off" = "Pois";

/* No comment provided by engineer. */
"Offline" = "Poissa";

/* No comment provided by engineer. */
"Offline, only showing downloaded messages" = "Offline, only showing downloaded messages";

/* No comment provided by engineer. */
"OK" = "OK";

/* Will be used as the caller name when a VoIP notification can't be decrypted */
"Old account" = "Vanha tili";

/* No comment provided by engineer. */
"Once a conversation is left, to rejoin a closed conversation, an invite is needed. An open conversation can be rejoined at any time." = "Once a conversation is left, to rejoin a closed conversation, an invite is needed. An open conversation can be rejoined at any time.";

/* No comment provided by engineer. */
"Once a conversation is unarchived, it will be shown by default again." = "Once a conversation is unarchived, it will be shown by default again.";

/* No comment provided by engineer. */
"Online" = "Paikalla";

/* No comment provided by engineer. */
"Online status" = "Online-tila";

/* No comment provided by engineer. */
"Only audio and screen shares" = "Only audio and screen shares";

/* No comment provided by engineer. */
"Only normal chat messages can be deleted" = "Only normal chat messages can be deleted";

/* No comment provided by engineer. */
"Only synchronize to trusted servers" = "Synkronoi vain luotetuille palveluille";

/* No comment provided by engineer. */
"Only visible to people matched via phone number integration" = "Only visible to people matched via phone number integration";

/* No comment provided by engineer. */
"Only visible to people on this instance and guests" = "Vain näkyvissä tämän instanssin ihmisille ja vieraille";

/* No comment provided by engineer. */
"Open" = "Open";

/* No comment provided by engineer. */
"Open app settings" = "Open app settings";

/* No comment provided by engineer. */
"Open conversation to registered users" = "Avaa keskustelu rekisteröityneille käyttäjille";

/* TRANSLATORS 'Open conversations' as a type of conversation. 'Open conversations' are conversations that can be found by other users */
"Open conversations" = "Avaa keskustelut";

/* No comment provided by engineer. */
"Open in %@" = "Avaa sovelluksella %@";

/* No comment provided by engineer. */
"Open in Google Maps" = "Open in Google Maps";

/* No comment provided by engineer. */
"Open in Maps" = "Open in Maps";

/* A menu to show additional options for the current conversation */
"Option menu" = "Option menu";

/* No comment provided by engineer. */
"Other Accounts" = "Other Accounts";

/* No comment provided by engineer. */
"Other participants" = "Other participants";

/* No comment provided by engineer. */
"Others" = "Muut";

/* Owner of a repository */
"Owner" = "Omistaja";

/* No comment provided by engineer. */
"Participants" = "Participants";

/* No comment provided by engineer. */
"Password" = "Salasana";

/* No comment provided by engineer. */
"Password copied" = "Password copied";

/* No comment provided by engineer. */
"Password is secure" = "Password is secure";

/* No comment provided by engineer. */
"Password needs to be at least %d characters long" = "Password needs to be at least %d characters long";

/* No comment provided by engineer. */
"Password protection" = "Password protection";

/* No comment provided by engineer. */
"Pending invitations" = "Pending invitations";

/* No comment provided by engineer. */
"Phone number" = "Puhelinnumero";

/* No comment provided by engineer. */
"Phone number integration" = "Puhelinnumeron integraatio";

/* No comment provided by engineer. */
"Phone number set successfully" = "Puhelinnumero asetettu onnistuneesti";

/* No comment provided by engineer. */
"Photo Library" = "Kuvakirjasto";

/* No comment provided by engineer. */
"Photo library access" = "Photo library access";

/* No comment provided by engineer. */
"Pick date & time" = "Pick date & time";

/* Pin a message to be always visible in the chat */
"Pin message" = "Pin message";

/* Message was pinned at … */
"Pinned at %@" = "Pinned at %@";

/* A message was pinned by ... */
"pinned by" = "pinned by";

/* No comment provided by engineer. */
"Pinned messages" = "Pinned messages";

/* Message is pinned until … */
"Pinned until %@" = "Pinned until %@";

/* No comment provided by engineer. */
"Please check that you entered a valid server address." = "Varmista, että määritit palvelimen osoitteen oikein.";

/* No comment provided by engineer. */
"Please check that you entered the correct Tassos server address." = "Varmista, että määritit Tassos-palvelimen osoitteen oikein.";

/* No comment provided by engineer. */
"Please check that you entered the correct server address." = "Please check that you entered the correct server address.";

/* No comment provided by engineer. */
"Please contact your system administrator." = "Please contact your system administrator.";

/* Please update your server with the latest {app name} version available. */
"Please update your server with the latest %@ version available." = "Please update your server with the latest %@ version available.";

/* No comment provided by engineer. */
"Please update." = "Please update.";

/* No comment provided by engineer. */
"Poll" = "Kysely";

/* No comment provided by engineer. */
"Poll draft" = "Poll draft";

/* No comment provided by engineer. */
"Poll draft has been saved" = "Poll draft has been saved";

/* No comment provided by engineer. */
"Poll drafts" = "Poll drafts";

/* No comment provided by engineer. */
"Poll results" = "Kyselyn tulokset";

/* No comment provided by engineer. */
"Polls" = "Kyselyt";

/* No comment provided by engineer. */
"Preview" = "Esikatselu";

/* No comment provided by engineer. */
"Privacy" = "Tietosuoja";

/* No comment provided by engineer. */
"Private" = "Yksityinen";

/* Show private conversations before group ones */
"Private first" = "Private first";

/* No comment provided by engineer. */
"Profile" = "Profiili";

/* No comment provided by engineer. */
"Profile picture" = "Profiilikuva";

/* No comment provided by engineer. */
"Promote to moderator" = "Ylennä moderaattoriksi";

/* No comment provided by engineer. */
"Published" = "Julkaistu";

/* No comment provided by engineer. */
"Push notifications" = "Push-ilmoitukset";

/* No comment provided by engineer. */
"Question" = "Kysymys";

/* No comment provided by engineer. */
"Raise hand" = "Nosta käsi";

/* No comment provided by engineer. */
"Reachable?" = "Reachable?";

/* No comment provided by engineer. */
"Reactions" = "Reactions";

/* No comment provided by engineer. */
"Read status" = "Lue tila";

/* No comment provided by engineer. */
"Received call from an old account" = "Received call from an old account";

/* No comment provided by engineer. */
"Recent threads" = "Recent threads";

/* No comment provided by engineer. */
"Record voice message" = "Äänitä ääniviesti";

/* No comment provided by engineer. */
"Recording" = "Recording";

/* No comment provided by engineer. */
"Recording consent is required" = "Recording consent is required";

/* No comment provided by engineer. */
"Recording consent required for joining the call" = "Recording consent required for joining the call";

/* No comment provided by engineer. */
"Recordings" = "Tallenteet";

/* No comment provided by engineer. */
"Redo" = "Tee uudelleen";

/* No comment provided by engineer. */
"Reference API supported?" = "Reference API supported?";

/* No comment provided by engineer. */
"Reject" = "Reject";

/* No comment provided by engineer. */
"Reminder was successfully cleared" = "Reminder was successfully cleared";

/* No comment provided by engineer. */
"Reminder was successfully set" = "Reminder was successfully set";

/* No comment provided by engineer. */
"Remote server is unreachable" = "Remote server is unreachable";

/* No comment provided by engineer. */
"Remove" = "Poista";

/* No comment provided by engineer. */
"Remove account" = "Poista tili";

/* No comment provided by engineer. */
"Remove from favorites" = "Poista suosikeista";

/* No comment provided by engineer. */
"Remove group and members" = "Poista ryhmä ja jäsenet";

/* No comment provided by engineer. */
"Remove old duplicate entries and leave only the most recent entries." = "Remove old duplicate entries and leave only the most recent entries.";

/* No comment provided by engineer. */
"Remove participant" = "Poista osallistuja";

/* No comment provided by engineer. */
"Remove password" = "Poista salasana";

/* No comment provided by engineer. */
"Remove team and members" = "Remove team and members";

/* Replacement in case of out of office */
"Replacement" = "Replacement";

/* Replacement in case of out of office */
"Replacement (optional)" = "Replacement (optional)";

/* No comment provided by engineer. */
"Reply" = "Vastaa";

/* No comment provided by engineer. */
"Reply privately" = "Vastaa yksityisesti";

/* Name of a repository */
"Repo" = "Repo";

/* Reschedule a message that is send later */
"Reschedule" = "Reschedule";

/* Reschedule a message that is send later with a notification */
"Reschedule with notification" = "Reschedule with notification";

/* Reschedule a message that is send later without a notification */
"Reschedule without notification" = "Reschedule without notification";

/* No comment provided by engineer. */
"Resend" = "Lähetä uudelleen";

/* No comment provided by engineer. */
"Resend invitation" = "Lähetä kutsu uudelleen";

/* No comment provided by engineer. */
"Resend invitations" = "Lähetä kutsut uudelleen";

/* Title for a section where different reset options are shown */
"Reset" = "Reset";

/* Replacement in case of out of office */
"Reset replacement" = "Reset replacement";

/* Results of a poll */
"Results" = "Tulokset";

/* No comment provided by engineer. */
"Retry" = "Yritä uudelleen";

/* Save conversation description */
"Save" = "Tallenna";

/* No comment provided by engineer. */
"Save as draft" = "Save as draft";

/* No comment provided by engineer. */
"Save password" = "Save password";

/* No comment provided by engineer. */
"Save to 'Note to self'" = "Save to 'Note to self'";

/* No comment provided by engineer. */
"Say hi to your friends and colleagues!" = "Sano hei ystävillesi ja työkavereillesi!";

/* No comment provided by engineer. */
"Scan QR code" = "Scan QR code";

/* Noun. 'Schedule' of a meeting */
"Schedule" = "Schedule";

/* No comment provided by engineer. */
"Schedule a meeting" = "Schedule a meeting";

/* No comment provided by engineer. */
"Scheduled messages" = "Scheduled messages";

/* No comment provided by engineer. */
"Screensharing stopped" = "Screensharing stopped";

/* No comment provided by engineer. */
"Search" = "Etsi";

/* No comment provided by engineer. */
"Search for places" = "Search for places";

/* Replacement in case of out of office */
"Select a replacement" = "Select a replacement";

/* No comment provided by engineer. */
"Select language" = "Select language";

/* Copy a 'selection' of a message */
"Selection" = "Selection";

/* No comment provided by engineer. */
"Send" = "Lähetä";

/* No comment provided by engineer. */
"Send a reaction" = "Send a reaction";

/* No comment provided by engineer. */
"Send call notification" = "Lähetä puheluilmoitus";

/* No comment provided by engineer. */
"Send later" = "Send later";

/* No comment provided by engineer. */
"Send later without notification" = "Send later without notification";

/* No comment provided by engineer. */
"Send message" = "Lähetä viesti";

/* Send a message now */
"Send now" = "Send now";

/* No comment provided by engineer. */
"Send without notification" = "Lähetä ilman ilmoitusta";

/* No comment provided by engineer. */
"Send/Accept" = "Lähetä/Hyväksy";

/* No comment provided by engineer. */
"Sending no invitations" = "Sending no invitations";

/* No comment provided by engineer. */
"Sensitive conversation" = "Sensitive conversation";

/* A message has been sent without notifications */
"Sent without notification" = "Sent without notification";

/* No comment provided by engineer. */
"Server" = "Palvelin";

/* No comment provided by engineer. */
"Server address https://…" = "Palvelimen osoite https://…";

/* No comment provided by engineer. */
"Server is currently in maintenance mode" = "Palvelin on parhaillaan huoltotilassa";

/* No comment provided by engineer. */
"Server not found" = "Server not found";

/* No comment provided by engineer. */
"Set" = "Aseta";

/* No comment provided by engineer. */
"Set password" = "Aseta salasana";

/* Remind me later about that message */
"Set reminder" = "Set reminder";

/* No comment provided by engineer. */
"Set status message" = "Aseta tilaviesti";

/* No comment provided by engineer. */
"Settings" = "Asetukset";

/* No comment provided by engineer. */
"Share" = "Jaa";

/* No comment provided by engineer. */
"Share a file from your Tassos" = "Jaa tiedosto Tassosista";

/* No comment provided by engineer. */
"Share current location" = "Jaa nykyinen sijainti";

/* No comment provided by engineer. */
"Share link" = "Jaa linkki";

/* No comment provided by engineer. */
"Share location" = "Jaa sijainti";

/* Share the location of a pin that has been dropped in a map view */
"Share pin location" = "Share pin location";

/* No comment provided by engineer. */
"Share to chat" = "Share to chat";

/* No comment provided by engineer. */
"Share with" = "Jaa";

/* No comment provided by engineer. */
"Shared items" = "Jaetut tietueet";

/* No comment provided by engineer. */
"Shared location" = "Jaettu sijainti";

/* No comment provided by engineer. */
"Sharing to a federated conversation is not supported." = "Sharing to a federated conversation is not supported.";

/* No comment provided by engineer. */
"Short absence status" = "Short absence status";

/* No comment provided by engineer. */
"Short absence status is too long" = "Short absence status is too long";

/* No comment provided by engineer. */
"Show more…" = "Näytä lisää…";

/* No comment provided by engineer. */
"Signaling" = "Signaling";

/* No comment provided by engineer. */
"SIP dial-in" = "SIP dial-in";

/* No comment provided by engineer. */
"Skip" = "Ohita";

/* No comment provided by engineer. */
"Slide to cancel" = "Slide to cancel";

/* No comment provided by engineer. */
"Some messages not shown, will be downloaded when online" = "Some messages not shown, will be downloaded when online";

/* Title for conversations sorting options */
"Sort conversations" = "Sort conversations";

/* No comment provided by engineer. */
"Source code" = "Source code";

/* speaker = Loudspeaker, device */
"Speaker" = "Kaiutin";

/* speaker = Loudspeaker, device */
"Speaker disabled" = "Kaiutin poistettu käytöstä";

/* speaker = Loudspeaker, device */
"Speaker enabled" = "Kaiutin käytössä";

/* No comment provided by engineer. */
"Speech recognition access is not allowed. Check your settings." = "Speech recognition access is not allowed. Check your settings.";

/* No comment provided by engineer. */
"Speech recognition failed" = "Speech recognition failed";

/* No comment provided by engineer. */
"Start a new group conversation" = "Start a new group conversation";

/* No comment provided by engineer. */
"Start call" = "Start call";

/* No comment provided by engineer. */
"Start call silently" = "Start call silently";

/* No comment provided by engineer. */
"Start recording" = "Start recording";

/* No comment provided by engineer. */
"Start time" = "Aloitusaika";

/* No comment provided by engineer. */
"Start video call" = "Start video call";

/* No comment provided by engineer. */
"Start video call silently" = "Start video call silently";

/* No comment provided by engineer. */
"Status" = "Tila";

/* No comment provided by engineer. */
"Status message" = "Tilaviesti";

/* Action to 'Stop' a recording */
"Stop" = "Stop";

/* No comment provided by engineer. */
"Stop recording" = "Stop recording";

/* No comment provided by engineer. */
"Stop screensharing" = "Stop screensharing";

/* Strikethrough text */
"Strikethrough" = "Strikethrough";

/* No comment provided by engineer. */
"STUN servers" = "STUN-palvelimet";

/* No comment provided by engineer. */
"Submit vote" = "Lähetä ääni";

/* No comment provided by engineer. */
"Switch account" = "Switch account";

/* No comment provided by engineer. */
"Switching to another conversation …" = "Switching to another conversation …";

/* No comment provided by engineer. */
"Synchronize to trusted servers and the global and public address book" = "Synchronize to trusted servers and the global and public address book";

/* Talk to a user */
"Talk to" = "Talk to";

/* No comment provided by engineer. */
"Tap and hold to record a voice message" = "Tap and hold to record a voice message";

/* No comment provided by engineer. */
"Tap and hold to record a voice message, release the button to send it." = "Tap and hold to record a voice message, release the button to send it.";

/* No comment provided by engineer. */
"Test failed" = "Test failed";

/* No comment provided by engineer. */
"Test push notifications" = "Test push notifications";

/* No comment provided by engineer. */
"Test results" = "Test results";

/* No comment provided by engineer. */
"Test results copied" = "Test results copied";

/* No comment provided by engineer. */
"The app is too old and no longer supported by this server." = "The app is too old and no longer supported by this server.";

/* No comment provided by engineer. */
"The call for this event ended. Do you want to delete this conversation for everyone?" = "The call for this event ended. Do you want to delete this conversation for everyone?";

/* No comment provided by engineer. */
"The call has been running for one hour" = "The call has been running for one hour";

/* No comment provided by engineer. */
"The call might be recorded" = "The call might be recorded";

/* No comment provided by engineer. */
"The password is wrong" = "Salasana on väärin";

/* No comment provided by engineer. */
"The recording might include your voice, video from camera, and screen share. Your consent is required before joining the call." = "The recording might include your voice, video from camera, and screen share. Your consent is required before joining the call.";

/* No comment provided by engineer. */
"The token might be used already or is expired. Please generate a new QR code and retry." = "The token might be used already or is expired. Please generate a new QR code and retry.";

/* No comment provided by engineer. */
"There is no account for user %@ in server %@ configured in this app." = "There is no account for user %1$@ in server %2$@ configured in this app.";

/* No comment provided by engineer. */
"This call is being recorded" = "This call is being recorded";

/* No comment provided by engineer. */
"This conversation is attached to a calendar event. Edit the event to change the name/description of the conversation." = "This conversation is attached to a calendar event. Edit the event to change the name/description of the conversation.";

/* No comment provided by engineer. */
"This conversation is read-only" = "Keskustelu on \"vain luku\"-tilassa";

/* No comment provided by engineer. */
"This conversation will be automatically deleted for everyone in %ld days of no activity." = "This conversation will be automatically deleted for everyone in %ld days of no activity.";

/* No comment provided by engineer. */
"This is the web address you use to access your server in your web browser." = "This is the web address you use to access your server in your web browser.";

/* The meeting start time will be displayed after this text e.g (This meeting is scheduled for tomorrow at 10:00) */
"This meeting is scheduled for" = "This meeting is scheduled for";

/* No comment provided by engineer. */
"This might take a moment" = "This might take a moment";

/* No comment provided by engineer. */
"This summary is AI generated and may contain mistakes." = "This summary is AI generated and may contain mistakes.";

/* No comment provided by engineer. */
"This usually indicates that this device was previously used for an account, which was not properly removed from the server." = "This usually indicates that this device was previously used for an account, which was not properly removed from the server.";

/* No comment provided by engineer. */
"This week" = "Tämä viikko";

/* Remind me this weekend about that message */
"This weekend" = "This weekend";

/* No comment provided by engineer. */
"This will impact the functionality of this app. Please review your settings." = "This will impact the functionality of this app. Please review your settings.";

/* No comment provided by engineer. */
"Thread" = "Thread";

/* No comment provided by engineer. */
"Thread notification level button" = "Thread notification level button";

/* No comment provided by engineer. */
"Thread title" = "Thread title";

/* No comment provided by engineer. */
"Threads" = "Threads";

/* No comment provided by engineer. */
"Title" = "Title";

/* 'To' which language user wants to translate text */
"To" = "To";

/* No comment provided by engineer. */
"To resolve this issue, use the web interface and go to \"Settings -> Security\"." = "To resolve this issue, use the web interface and go to \"Settings -> Security\".";

/* TRANSLATORS this is for sending something 'to' a user. E.g. 'To: John Doe' */
"To:" = "Päättyen:";

/* No comment provided by engineer. */
"Today" = "Tänään";

/* Remind me tomorrow about that message */
"Tomorrow" = "Tomorrow";

/* TRANSLATORS this is for transcribing a voice message to text */
"Transcribe" = "Transcribe";

/* TRANSLATORS transcript of a voice-message */
"Transcript" = "Transcript";

/* No comment provided by engineer. */
"Translate" = "Translate";

/* No comment provided by engineer. */
"Translation" = "Translation";

/* No comment provided by engineer. */
"Translation failed" = "Translation failed";

/* Waiting message when trying to login with QR code */
"Trying to login…" = "Trying to login…";

/* No comment provided by engineer. */
"TURN servers" = "TURN-palvelin";

/* No comment provided by engineer. */
"Twitter" = "Twitter";

/* No comment provided by engineer. */
"Twitter handle @…" = "Twitter-tunnus @…";

/* No comment provided by engineer. */
"Typing indicator" = "Typing indicator";

/* No comment provided by engineer. */
"Typing indicators are only available when using a high performance backend (HPB)" = "Typing indicators are only available when using a high performance backend (HPB)";

/* No comment provided by engineer. */
"Unable to get context of the message" = "Unable to get context of the message";

/* No comment provided by engineer. */
"Unable to get conversation of the message" = "Unable to get conversation of the message";

/* No comment provided by engineer. */
"Unable to load file" = "Tiedostoa ei voitu ladata";

/* No comment provided by engineer. */
"Unable to open file" = "Tiedostoa ei voitu avata";

/* No comment provided by engineer. */
"Unable to validate password right now" = "Unable to validate password right now";

/* No comment provided by engineer. */
"Unarchive conversation" = "Unarchive conversation";

/* No comment provided by engineer. */
"Unavailable" = "Unavailable";

/* No comment provided by engineer. */
"Unban" = "Unban";

/* No comment provided by engineer. */
"Under \"Devices & sessions\" check if there are duplicate entries for the same device." = "Under \"Devices & sessions\" check if there are duplicate entries for the same device.";

/* No comment provided by engineer. */
"Undo" = "Kumoa";

/* No comment provided by engineer. */
"Undo Typing" = "Undo Typing";

/* No comment provided by engineer. */
"Unknown" = "Tuntematon";

/* No comment provided by engineer. */
"Unknown error" = "Tuntematon virhe";

/* No comment provided by engineer. */
"Unknown error occurred" = "Tuntematon virhe tapahtui";

/* No comment provided by engineer. */
"Unpin" = "Unpin";

/* No comment provided by engineer. */
"Unpin message" = "Unpin message";

/* 'Unread' meaning 'Unread conversations' */
"Unread" = "Unread";

/* No comment provided by engineer. */
"Unread mentions" = "Lukemattomat maininnat";

/* No comment provided by engineer. */
"Unread messages" = "Lukemattomat viestit";

/* Calling is not supported */
"Unsupported" = "Unsupported";

/* No comment provided by engineer. */
"Update" = "Update";

/* No comment provided by engineer. */
"Updated notification settings" = "Updated notification settings";

/* No comment provided by engineer. */
"Upload failed" = "Lähetys epäonnistui";

/* No comment provided by engineer. */
"Uploading %ld elements" = "Uploading %ld elements";

/* No comment provided by engineer. */
"User" = "Käyttäjä";

/* No comment provided by engineer. */
"User profile and settings" = "Käyttäjäprofiili ja asetukset";

/* No comment provided by engineer. */
"User status supported?" = "User status supported?";

/* No comment provided by engineer. */
"User storage quota exceeded" = "User storage quota exceeded";

/* No comment provided by engineer. */
"Users" = "Käyttäjät";

/* No comment provided by engineer. */
"Validating password…" = "Validating password…";

/* No comment provided by engineer. */
"Version" = "Versio";

/* Join a call in video call mode */
"Video call" = "Videopuhelu";

/* No comment provided by engineer. */
"Video quality" = "Videon laatu";

/* Conversation visibility settings */
"Visibility" = "Näkyvyys";

/* No comment provided by engineer. */
"Voice messages" = "Ääniviestit";

/* No comment provided by engineer. */
"Waiting for %@ to join call …" = "Waiting for %@ to join call …";

/* No comment provided by engineer. */
"Waiting for others to join call …" = "Odotetaan muiden liittymistä puheluun...";

/* No comment provided by engineer. */
"Website" = "Verkkosivu";

/* No comment provided by engineer. */
"What is your status?" = "Mikä on tilatietosi?";

/* No comment provided by engineer. */
"Write message, @ to mention someone …" = "Kirjoita viesti, käytä @-merkkiä mainitaksesi käyttäjän…";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"Yesterday" = "Eilen";

/* No comment provided by engineer. */
"You" = "Sinä";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate it */
"You added {user0} and %ld more participants" = "You added {user0} and %ld more participants";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"You added {user0} and {user1}" = "You added {user0} and {user1}";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"You and %ld more participants joined the call" = "You and %ld more participants joined the call";

/* Please put %ld placeholder in the correct position on the translated text but do not translate it */
"You and %ld more participants left the call" = "You and %ld more participants left the call";

/* Please put {actor0} placeholder in the correct position on the translated text but do not translate it */
"You and {actor0} joined the call" = "You and {actor0} joined the call";

/* Please put {actor0} placeholder in the correct position on the translated text but do not translate it */
"You and {actor0} left the call" = "You and {actor0} left the call";

/* No comment provided by engineer. */
"You are currently waiting in the lobby" = "Odotat parhaillaan aulassa";

/* No comment provided by engineer. */
"You are not allowed to add or remove reactions in this conversation" = "You are not allowed to add or remove reactions in this conversation";

/* No comment provided by engineer. */
"You are not part of any conversation" = "You are not part of any conversation";

/* No comment provided by engineer. */
"You are not part of any conversation. Press + to start a new one." = "You are not part of any conversation. Press + to start a new one.";

/* No comment provided by engineer. */
"You can set your phone number so other users will be able to find you" = "You can set your phone number so other users will be able to find you";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"You demoted {user0} and %ld more participants from moderators" = "You demoted {user0} and %ld more participants from moderators";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"You demoted {user0} and {user1} from moderators" = "You demoted {user0} and {user1} from moderators";

/* No comment provided by engineer. */
"You have %ld pending invitations" = "You have %ld pending invitations";

/* No comment provided by engineer. */
"You have been muted by a moderator" = "Moderaattori on mykistänyt sinut";

/* No comment provided by engineer. */
"You have no meetings scheduled." = "You have no meetings scheduled.";

/* No comment provided by engineer. */
"You have no unread mentions." = "You have no unread mentions.";

/* No comment provided by engineer. */
"You have no unread messages." = "You have no unread messages.";

/* No comment provided by engineer. */
"You need to promote a new moderator before you can leave %@." = "You need to promote a new moderator before you can leave %@.";

/* No comment provided by engineer. */
"You need to promote a new moderator before you can leave this conversation" = "You need to promote a new moderator before you can leave this conversation";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"You promoted {user0} and %ld more participants to moderators" = "You promoted {user0} and %ld more participants to moderators";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"You promoted {user0} and {user1} to moderators" = "You promoted {user0} and {user1} to moderators";

/* No comment provided by engineer. */
"You received a new notification" = "Sait uuden ilmoituksen";

/* No comment provided by engineer. */
"You reconnected to the call" = "You reconnected to the call";

/* Please put {user0} and %ld placeholders in the correct position on the translated text but do not translate it */
"You removed {user0} and %ld more participants" = "You removed {user0} and %ld more participants";

/* Please put {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"You removed {user0} and {user1}" = "You removed {user0} and {user1}";

/* No comment provided by engineer. */
"Your email address" = "Sähköpostiosoitteesi";

/* No comment provided by engineer. */
"Your phone number" = "Puhelinnumerosi";

/* No comment provided by engineer. */
"Your PIN" = "PIN-koodisi";

/* No comment provided by engineer. */
"Your postal address" = "Postiosoitteesi";

/* 'Zammad' is a product name */
"Zammad API error" = "Zammad API error";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} added you and %ld more participants" = "{actor0} added you and %ld more participants";

/* Please put {actor0} and {user0} placeholders in the correct position on the translated text but do not translate them */
"{actor0} added you and {user0}" = "{actor0} added you and {user0}";

/* Please put {actor0}, {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} added {user0} and %ld more participants" = "{actor0} added {user0} and %ld more participants";

/* Please put {actor0}, {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} added {user0} and {user1}" = "{actor0} added {user0} and {user1}";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} and %ld more participants joined the call" = "{actor0} and %ld more participants joined the call";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} and %ld more participants left the call" = "{actor0} and %ld more participants left the call";

/* Please put {actor0} and {actor1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} and {actor1} joined the call" = "{actor0} and {actor1} joined the call";

/* Please put {actor0} and {actor1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} and {actor1} left the call" = "{actor0} and {actor1} left the call";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} demoted you and %ld more participants from moderators" = "{actor0} demoted you and %ld more participants from moderators";

/* Please put {actor0} and {user0} placeholders in the correct position on the translated text but do not translate them */
"{actor0} demoted you and {user0} from moderators" = "{actor0} demoted you and {user0} from moderators";

/* Please put {actor0}, {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} demoted {user0} and %ld more participants from moderators" = "{actor0} demoted {user0} and %ld more participants from moderators";

/* Please put {actor0}, {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} demoted {user0} and {user1} from moderators" = "{actor0} demoted {user0} and {user1} from moderators";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} promoted you and %ld more participants to moderators" = "{actor0} promoted you and %ld more participants to moderators";

/* Please put {actor0} and {user0} placeholders in the correct position on the translated text but do not translate them */
"{actor0} promoted you and {user0} to moderators" = "{actor0} promoted you and {user0} to moderators";

/* Please put {actor0}, {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} promoted {user0} and %ld more participants to moderators" = "{actor0} promoted {user0} and %ld more participants to moderators";

/* Please put {actor0}, {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} promoted {user0} and {user1} to moderators" = "{actor0} promoted {user0} and {user1} to moderators";

/* Please put {actor0} placeholder in the correct position on the translated text but do not translate it */
"{actor0} reconnected to the call" = "{actor0} reconnected to the call";

/* Please put {actor0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} removed you and %ld more participants" = "{actor0} removed you and %ld more participants";

/* Please put {actor0} and {user0} placeholders in the correct position on the translated text but do not translate them */
"{actor0} removed you and {user0}" = "{actor0} removed you and {user0}";

/* Please put {actor0}, {user0} and %ld placeholders in the correct position on the translated text but do not translate them */
"{actor0} removed {user0} and %ld more participants" = "{actor0} removed {user0} and %ld more participants";

/* Please put {actor0}, {user0} and {user1} placeholders in the correct position on the translated text but do not translate them */
"{actor0} removed {user0} and {user1}" = "{actor0} removed {user0} and {user1}";

/* No comment provided by engineer. */
"↓ New messages" = "↓ Uudet viestit";

